Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: At the moment :mod:`cuspy` functions can be used to configure the sections in bold, which include all mandatory sections and some optional ones.
fr_fr: Pour le moment les fonctions de :mod:`cuspy` peuvent être utilisées pour configurer les sections en graisse, et elles incluent toutes les sections obligatoires et quelques-unes d'optionnelles.

source: Authors
fr_fr: Auteurs

source: Based on Beven & Young (2013).
fr_fr: Basé sur Beven & Young (2013).

source: Be careful to maintain the reST formatting in the translated version.
fr_fr: Faites attention à maintenir le formatage reST dans la version traduite.

source: Beck (1987) identified four types of problems that are the object of uncertainty analysis:
fr_fr: Beck (1987) a identifié quatre types de problèmes qui font l'objet de l'analyse d'incertitudes :

source: Before starting the analyses, you need to prepare all the input files and scripts required by the model.
fr_fr: Avant de commencer les analyses, vous devez préparer tous les fichiers d'entrée et les scripts dont le modèle a besoin.

source: Before starting the translation it is advisable to check the source files thoroughly to eliminate any language or format issues.
fr_fr: Avant de commencer la traduction il est conseillé de relire attentivement les fichiers source pour éliminer des erreurs linguistiques ou de format.

source: Before starting the translation, the value of msgstr is empty:
fr_fr: Avant de démarrer la traduction, la valeur de msgstr est vide :

source: Besides, the power of the second singular value is quite near to this threshold.
fr_fr: D'ailleurs, la puissance de la deuxième valeur singulière est assez proche de ce seuil.

source: But having as much (or more) observations as parameters does not ensure they are identifiable.
fr_fr: Mais le fait d'avoir autant (ou plus) d'observations que paramètres n'assure pas qu'ils soient identifiables.

source: But only 1, according to Gavish & Donoho's hard threshold.
fr_fr: Mais seulement 1, d'après le seuil strict de Gavish & Donoho.

source: But structural identifiability does not imply practical identifiability.
fr_fr: Mais l'identifiabilité structurale n'implique pas l'identifiabilité pratique.

source: But the available data does not allow to determine as well the location of the S-curve asymptotes indicated by :math:`\alpha` and :math:`\beta`.
fr_fr: Mais les données disponibles ne permettent de déterminer également bien la position des asymptotes de la courbe en forme de S, indiquée par :math:`\alpha` et :math:`\beta`.

source: But there cases when even these methods may have problems in identifying a simple set of parameter values.
fr_fr: Mais il y a des cas où même ces méthodes peuvent avoir des problèmes à identifier un ensemble de valeurs des paramètres unique.

source: But to determine the characteristics of noise may require a large dataset.
fr_fr: Mais pour déterminer les caractéristiques du bruit il peut être nécessaire d'utiliser un jeu de données très riche.

source: By analysing these cases, and collecting complementary data, the models may also be used to improve our knowledge of the modelled system.
fr_fr: Par l'analyse de ces cas, et la récollection de données complémentaires, les modèles peuvent être utilisés aussi pour améliorer notre compréhension du système modélisé.

source: By assigning observations to different groups, we obtain a multiple-component objective function.
fr_fr: Si on assigne les observations à différents groupes, on obtient une fonction d'objectifs multiples.

source: By comparing the simulation results to observations it is possible to detect circumstances when the model does not perform well.
fr_fr: À travers la comparaison des résultats de simulation aux observations il est possible d'identifier des cas où le comportement du modèle est pire.

source: Calibrate model (GLM or DE methods).
fr_fr: Calibre le modèle (méthodes GLM ou DE).

source: Calibrated values of model parameters
fr_fr: Valeurs calibrées des paramètres du modèle

source: Calibration with GLM or DE
fr_fr: Calibration avec GLM ou DE

source: Calibration, parameter estimation and history matching are three synonyms for the process of finding the optimal value of a model's parameters.
fr_fr: Calibration, estimation de paramètres et couplage d'historique sont trois synonymes pour le procès d'identification de la valeur optimale des paramètres d'un modèle.

source: Carry global sensitivity analysis (Morris or Sobol methods).
fr_fr: Réalise une analyse de sensitivité globale (méthode de Morris ou de Sobol).

source: Carry linear uncertainty calculations.
fr_fr: Réalise les calculs linéaires d'incertitude.

source: Carry the analyses
fr_fr: Réalisation des analyses

source: Characterisation of the data for calibrating and testing.
fr_fr: Caractérisation des données à utiliser pour la calibration et la réalisation de tests.

source: Check the quality of the data (presence of outliers, inhomogeneities, etc.) and its extension (is it sufficient?).
fr_fr: Il faut vérifier la qualité des données (présence de valeurs aberrantes, inhomogénéités, etc.) et leur extension (est-ce qu'elles sont suffisantes ?).

source: Cloning repositories
fr_fr: Clonage du répertoire

source: Coding style guide
fr_fr: Guide de style de codage

source: Column separator of the output file.
fr_fr: Séparateur de colonnes du fichier de sortie.

source: Command line application
fr_fr: Application en ligne de commande

source: Compilation of the project documentation
fr_fr: Compilation de la documentation du projet

source: Compilation of the translated documentation
fr_fr: Compilation de la documentation traduite

source: Compiling PEST++ executables
fr_fr: Compilation des exécutables de PEST++

source: Complex models can include formulations describing different types of behaviours.
fr_fr: Les modèles complexes peuvent inclure formulations qui décrivent plusieurs types de comportements.

source: Computational cost of different types of analyses
fr_fr: Coût computationnel de différents types d'analyse

source: Conceptualisation of the system, specification of data and prior knowledge
fr_fr: Conceptualisation du système, spécification de données et des connaissances a priori

source: Conditional evaluation that a computer model code is suitable for use in a particular type of application.
fr_fr: Évaluation conditionnelle que le code informatique d'un modèle est approprié pour son utilisation dans un certain type particulier d'application.

source: Conditional evaluation that a model computer code reproduces some observed behaviour of the system being studied to an acceptable degree.
fr_fr: Évaluation conditionnelle que le code informatique d'un modèle reproduis quelque comportement observé du système étudié avec une qualité acceptable.

source: Conditional verification, including diagnostic testing
fr_fr: Vérification conditionnelle, inclus les tests de diagnose

source: Contents:
fr_fr: Contenu :

source: Creation of PEST files
fr_fr: Création des fichiers PEST

source: Creation of POT and PO files
fr_fr: Création de fichiers POT et PO

source: DE is a global calibration method that explores the whole parameter space, rather than a local range of parameter values.
fr_fr: La DE est une méthode de calibration globale qui explore l'entier espace des paramètres, plutôt qu'un rang local de valeurs des paramètres.

source: Data worth
fr_fr: Valeur des données

source: Data worth measures the potential of reduction of the uncertainty of relevant management predictions.
fr_fr: La valeur des données mesure le potentiel de réduction de l'incertitude de prédictions relevantes pour la gestion.

source: Data worth or value of information is an assessment of the value of data.
fr_fr: La valeur des données ou de l'information est une évaluation de l'utilité des données.

source: Declarations of PEST++ variables (the string "++" followed by the variable name and value) can be located anywhere in the PEST control file, but they are placed at the end of the file by :func:`write_pest_files`.
fr_fr: Les déclarations des variables de PEST++ (la chaîne "++" suivie par le nom et valeur de la variable) peuvent être localisées n'importe où dans le fichier de contrôle de PEST, mais elles sont placées à la fin du fichier par :func:`write_pest_files`.

source: Defining sensitivity as the partial derivative of the output :math:`Y` with respect to a parameter :math:`X_i`: :math:`S_i={\delta Y}/{\delta X_i}`.
fr_fr: En définissant la sensitivité comme la dérivée partielle de la sortie :math:`Y` par rapport au paramètre :math:`X_i` : :math:`S_i={\delta Y}/{\delta X_i}`.

source: Definition of the model purpose
fr_fr: Définition du but du modèle

source: Definitions
fr_fr: Définitions

source: Definitions of types of model output [#]_
fr_fr: Définitions des types de retour d'un modèle [#]_

source: Definitions on model evaluation [#]_
fr_fr: Définitions sur l'évaluation de modèles [#]_

source: Designing experiments or monitoring programs to reduce the main uncertainties.
fr_fr: La planification expérimentale ou programmes de surveillance pour réduire les principales incertitudes.

source: Detailed instructions on how to format an instructions file can be found in White et al.
fr_fr: Des instructions détaillées sur comment formater un fichier d'instructions peuvent être trouvées dans White et al.

source: Determination of the method to identify model structure and parameter values
fr_fr: Détermination de la méthode pour identifier la structure du modèle et les valeurs des paramètres

source: Dictionary of variable names for which partial averages will be calculated.
fr_fr: Dictionnaire de noms des variables pour lesquelles des moyennes partielles seront calculées.

source: Differential Evolution (DE), using the function :func:`calibration`.
fr_fr: Évolution Différentielle (DE), en utilisant la fonction :func:`calibration`.

source: Documentation in English
fr_fr: Documentation en anglais

source: Documentation in French
fr_fr: Documentation en français

source: Does the model reproduce known relations?
fr_fr: Le modèle reproduit de relations connues ?

source: During most of the year predictive uncertainty in the :math:`T_{air} + 1.5` ºC scenario is equal or lower to that during the base scenario, with the exception of July when it increases.
fr_fr: Durant la plupart de l'année l'incertitude prédictive du scénario :math:`T_{air} + 1.5`ºC est égale ou inférieure à celle du scénario de base, avec l'exception de juillet, quand elle est plus importante.

source: Each script illustrates how to make different types of analysis.
fr_fr: Chaque script démontre comment faire différents types d'analyses.

source: Environmental models cannot predict the future.
fr_fr: Les modèles environnementaux ne peuvent pas prédire le futur.

source: Error variance analysis also provides an estimation of parameter identifiability.
fr_fr: L'analyse de la variance de l'erreur proportionne aussi une estimation de l'identifiabilité des paramètres.

source: Error variance analysis is an alternative linear uncertainty analysis method that decomposes the variance of predictive error into three components:
fr_fr: L'analyse de la variance de l'erreur est une méthode linéaire alternative pour l'analyse d'incertitudes qui décompose la variance de l'erreur prédictive en trois composantes :

source: Error variance analysis.
fr_fr: Analyse de la variance de l'erreur.

source: Evaluation of model performance
fr_fr: Évaluation de la performance du modèle

source: Even in the absence of field data, we could still make an estimation based on previous scientific knowledge.
fr_fr: Même si on n'a pas de données de terrain, on peut encore faire une estimation en base aux connaissances scientifiques antérieures.

source: Example data to test the package :mod:`cuspy`
fr_fr: Données d'exemple pour tester le paquet :mod:`cuspy`

source: File name.
fr_fr: Nom du fichier.

source: Finally, some indices have also been proposed to evaluate identifiability.
fr_fr: Finalement, quelques indices ont été proposés pour évaluer l'identifiabilité.

source: First-order methods.
fr_fr: Méthodes de premier ordre.

source: Fit-for-purpose
fr_fr: Apte à l'utilisation prévue

source: Folder where the processed data will be written.
fr_fr: Dossier où écrire les données traitées.

source: For a comprehensive evaluation of models it is advisable to use systems of metrics (or multiple-objective functions) that measure different aspects of model performance.
fr_fr: Pour une évaluation compréhensive des modèles il est conseillé d'utiliser systèmes de métriques (ou fonctions à objectif multiple) qui mesurent différents aspects de la performance du modèle.

source: For details on the file structure and variables, please see PEST++ user manual.
fr_fr: Pour des détails sur la structure du fichier et ses variables, veuillez voire le manuel d'utilisation de PEST++.

source: For example, Monte Carlo methods such as GLUE (Generalized Likelihood Uncertainty Estimation) (Beven & Binley, 1992).
fr_fr: Par exemple, les méthodes de Monte Carlo comme GLUE (Generalized Likelihood Uncertainty Estimation) (Beven & Binley, 1992).

source: For example, a model may include descriptions of behaviours not present in the calibration data set, and thus their parameter values cannot be informed by observations.
fr_fr: Par exemple, un modèle peut inclure des descriptions de comportements qui ne sont pas représentés dans les données de calibration, et en conséquence les observations n'apportent pas information pour déterminer les valeurs de leurs paramètres.

source: For example, for :mod:`cuspy`:
fr_fr: Par exemple, pour :mod:`cuspy`:

source: For example, for French you need to do
fr_fr: Par exemple, pour la langue française vous devez faire

source: For example, in the GLM model, the user could have temperature measurements taken within the lake, water temperatures at the outlet, satellite temperatures at the surface, water level measurements, salinity measured within the lake and salinity at the outlet.
fr_fr: Par exemple, pour le modèle GLM, l'utilisateur pourrait avoir des mesures de température prises dans le lac, température de l'eau à l'exutoire, températures à la surface mesurées par satellite, mesures du niveau d'eau, salinité mesurée dans le lac et salinité à l'exutoire.

source: For example, in the OKP model, that estimates epilimnion and hypolimnion temperatures, measurements for each of these two compartments may be placed in different groups.
fr_fr: Par exemple, pour le modèle OKP, qu'estime la température de l'épilimnion et de l'hypolimnion, les mesures pour chaque de ces deux compartiments peuvent être placées dans de groupes différents.

source: For example, in the following equations the parameter values are unidentifiable:
fr_fr: Par exemple, dans les équations suivantes les valeurs des paramètres ne sont pas identifiables :

source: For example:
fr_fr: Par exemple :

source: For models with a large number of parameters, the computational cost of IES in terms of number of model runs is much smaller than that of Monte Carlo methods.
fr_fr: Pour les modèles avec un grand nombre de paramètres, le coût computationnel de l'IES en raison du nombre d'exécutions du modèle est beaucoup plus petit que celui des méthodes de Monte Carlo.

source: For more complex models this is still more useful.
fr_fr: Pour des modèles plus complexes ce-ci est encore de majeur utilité.

source: For more complex models, it is possible to use dotty plots, which show the variation of the response variable for one or two parameters while varying all other parameters.
fr_fr: Pour des modèles plus complexes, il est possible d'utiliser de graphiques de points, qui montrent la variation de la variable de réponse pour un ou deux paramètres à la fois que varient tous les autres paramètres.

source: For more details on the PEST++ executables, please see White et al.
fr_fr: Pour plus d'information sur les exécutables de PEST++, veuillez voire White et al.

source: For more information on other arguments (including some not used above), please see the function's description in the Modules section.
fr_fr: Pour plus d'information sur les autres arguments (incluant quelques-uns non-utilisés ci-dessus), veuillez voire la description de la fonction dans la section Modules.

source: For more information on the files used by PEST++, please see White et al.
fr_fr: Pour plus d'information sur les fichiers utilisés par PEST++, veuillez voire White et al.

source: For more information on the specification of these types of file see the PEST++ user guide.
fr_fr: Pour plus de renseignements sur la spécification de ces types de fichier voyez le manuel d'utilisation de PEST++.

source: For simple models, it is possible to visualize the response surface using 2D or 3D plots.
fr_fr: Pour de modèles simples, il est possible de visualiser la surface de réponse avec de graphiques en 2D ou 3D.

source: For this go to an appropriate directory (e.g., :file:`pathtoprojectsfolder`) where to copy the project's code in a subfolder and clone the project.
fr_fr: Pour ça, placez-vous dans un dossier approprié (p. ex., :file:`pathtoprojectsfolder`) où copier dans un sous-dossier le code du projet et clonez le projet :

source: For this you will need to have ``gcc``, ``gfortran`` and the libraries ``lapack`` and ``blas`` installed.
fr_fr: Pour ça vous avez besoin d'avoir ``gcc``, ``gfortran`` et les librairies ``lapack`` et ``blas`` installés sur votre ordinateur.

source: For this, the package :mod:`sphinx-intl` is used.
fr_fr: Pour ça, le package :mod:`sphinx-intl` est utilisé.

source: For under-determined cases.
fr_fr: Pour des cas sous-déterminés.

source: Forecast
fr_fr: Prédiction

source: From these parameters we can draw several random samples (e.g., 500 samples) and carry simulations with each set of parameter values.
fr_fr: On peut utiliser ces valeurs pour extraire plusieurs échantillons aléatoires (p. ex., 500 échantillons) des valeurs des paramètres et réaliser une simulation pour chaque jeu de valeurs des paramètres.

source: Functions to make analyses based on PEST++.
fr_fr: Fonctions pour réaliser des analyses basées sur PEST++.

source: Functions to read and write data.
fr_fr: Fonctions pour lire et écrire des données.

source: GLM algorithm with Tikhonov regularisation, using the function :func:`calibration`.
fr_fr: Algorithme GLM avec régularisation de Tikhonov, en utilisant la fonction :func:`calibration`.

source: Gauss-Levenberg-Marquardt (GLM) algorithm, using the function :func:`calibration`.
fr_fr: Algorithme de Gauss-Levenberg-Marquardt (GLM), en utilisant la fonction :func:`calibration`.

source: Get observation data
fr_fr: Obtient données observées

source: Given the large uncertainty at this point, a global sensitivity analysis method should be used.
fr_fr: Vu la large incertitude à ce point-ci, il faudrait utiliser une méthode d'analyse de sensitivité globale.

source: Global sensitivity analysis
fr_fr: Analyse de sensitivité globale

source: Global sensitivity analysis (GSA).
fr_fr: Analyse de sensitivité globale (GSA).

source: Good introductions to the concept of identifiability are given by Beck (1987) and Guillaume et al.
fr_fr: Bonnes introductions au concept d'identifiabilité sont données par Beck (1987) et Guillaume et al.

source: High computation time.
fr_fr: Long temps de calcul.

source: Hindcast
fr_fr: Simulation rétrospective

source: How confidently could we do it?
fr_fr: Quelle confidence peut-on attacher à nous estimations ?

source: How much would the simulated behaviour vary if we varied model structure, parameter values and input data within reasonable ranges?
fr_fr: En quel dégrée varie le comportement simulé si on varie la structure du modèle, les valeurs des paramètres et les données d'entrée dans des rangs raisonnables ?

source: However, a certain degree of uncertainty will always remain.
fr_fr: Cependant, un certain dégrée d'incertitude reste toujours.

source: However, a model may be sensitive to a given parameter and it may still not be possible to identify the parameter value.
fr_fr: Cependant, un modèle peut être sensible à un certain paramètre et il peut être comme même impossible d'identifier la valeur du paramètre.

source: However, although these methods do not allow an exact estimation of uncertainty, they provide semi-quantitative information sufficiently robust to analyse the relative contributions of different sources of uncertainty or parameters (Moore & Doherty, 2005).
fr_fr: Cependant, si bien ces méthodes ne permettent pas une estimation exacte de l'incertitude, elles proportionnent de l'information semi-quantitative suffisamment robuste pour analyser les contributions relatives de différentes sources d'incertitude des paramètres (Moore & Doherty, 2005).

source: However, before passing to calibration it is helpful to make a sensitivity analysis to find which are the parameters that have a greater influence in the simulation results.
fr_fr: Cependant, avant de passer à la calibration il est d'utilité de faire une analyse de sensitivité pour investiguer quels sont les paramètres avec une majeure influence sur les résultats de simulation.

source: However, calculation times are longer.
fr_fr: Pourtant, les temps de calcul sont plus longs.

source: However, for the other parameters the information is shared between them, and the calibration data only allows to estimate a combination of these parameters.
fr_fr: Par contre, pour les autres paramètres l'information est partagée entre eux, et les données de calibration nous permettent seulement d'estimer une combinaison de ces paramètres.

source: However, in nonlinear models sensitivity varies within the parameter space.
fr_fr: Cependant, dans les modèles non linéaires la sensitivité varie quand on se déplace dans l'espace des paramètres.

source: However, it can also recognise Markdown by installing the Markdown parser :mod:`recommonmark`.
fr_fr: Mais il peut aussi reconnaître le formatage Markdown si on installe le parseur Markdown :mod:`recommonmark`.

source: However, it is more efficient to use a PO editor (e.g., GNOME Translation Editor or PO edit) or computer assisted translation (CAT) software such as OmegaT.
fr_fr: Par contre, il est plus efficient d'utiliser un éditeur PO (p. ex., GNOME Traduction Editor ou PO edit) ou des logiciels de traduction assistée par ordinateur (TAO) comme OmegaT.

source: However, one of the difficulties in using error variance analysis lies in estimating the number of singular values to use, which may introduce a certain degree of subjectivity.
fr_fr: Pourtant, une des difficultés à utiliser l'analyse de la variance de l'erreur est celle d'estimer le nombre de valeurs singuliers à utiliser, ce qui peut introduire un certain dégrée de subjectivité.

source: However, some of the techniques presented in this document may inform other stages of the process too.
fr_fr: Cependant, quelques-unes des techniques présentées dans ce document peuvent apporter information utile pour d'autres étapes du procès aussi.

source: However, the fact that the measurement for 21 Sept.
fr_fr: Pourtant, le fait que la mesure pour le 21 sept.

source: However, the identification of an optimum may be hampered by the use of threshold parameters, by correlation between parameters, by autocorrelation and heteroscedasticity in the residuals and by insensitive parameters.
fr_fr: Cependant, l'identification d'un optimum peut être empêchée par l'utilisation de paramètres de seuil, par la corrélation entre paramètres, par l'autocorrélation et heteroscedasticité dans les résidus et par les paramètres auquel le modèle n'est pas sensible.
